<script setup lang="ts">
import DropdownAtom from '@/components/atoms/DropdownAtom.vue'
const model = defineModel<string>()
const dates = [
  '2025年1月1日(水)',
  '2025年1月2日(木)',
  '2025年1月3日(金)',
  '2025年1月4日(土)',
  '2025年1月5日(日)',
  '2025年1月6日(月)',
  '2025年1月7日(火)',
  '2025年1月8日(水)',
  '2025年1月9日(木)',
  '2025年1月10日(金)',
  '2025年1月11日(土)',
  '2025年1月12日(日)',
  '2025年1月13日(月)',
  '2025年1月14日(火)',
  '2025年1月15日(水)',
  '2025年1月16日(木)',
  '2025年1月17日(金)',
  '2025年1月18日(土)',
  '2025年1月19日(日)',
  '2025年1月20日(月)',
  '2025年1月21日(火)',
  '2025年1月22日(水)',
  '2025年1月23日(木)',
  '2025年1月24日(金)',
  '2025年1月25日(土)',
  '2025年1月26日(日)',
  '2025年1月27日(月)',
  '2025年1月28日(火)',
  '2025年1月29日(水)',
  '2025年1月30日(木)',
  '2025年1月31日(金)',
]
</script>

<template>
  <label>
    来場日
    <DropdownAtom :items="dates" v-model="model" />
  </label>
</template>
